{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "Input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 150, 1], "dtype": "float32", "sparse": false, "name": "Input_2"}, "inbound_nodes": []}, {"name": "Input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 150, 1], "dtype": "float32", "sparse": false, "name": "Input_1"}, "inbound_nodes": []}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["Input_2", 0, 0, {}], ["Input_1", 0, 0, {}]]]}, {"name": "Convolution2D_1", "class_name": "Conv2D", "config": {"name": "Convolution2D_1", "trainable": true, "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "MaxPooling2D_1", "class_name": "MaxPooling2D", "config": {"name": "MaxPooling2D_1", "trainable": true, "pool_size": [8, 8], "padding": "valid", "strides": [8, 8], "data_format": "channels_last"}, "inbound_nodes": [[["Convolution2D_1", 0, 0, {}]]]}, {"name": "BatchNormalization_1", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["MaxPooling2D_1", 0, 0, {}]]]}, {"name": "Activation_1", "class_name": "Activation", "config": {"name": "Activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNormalization_1", 0, 0, {}]]]}, {"name": "Convolution2D_2", "class_name": "Conv2D", "config": {"name": "Convolution2D_2", "trainable": true, "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Activation_1", 0, 0, {}]]]}, {"name": "Convolution2D_3", "class_name": "Conv2D", "config": {"name": "Convolution2D_3", "trainable": true, "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Activation_1", 0, 0, {}]]]}, {"name": "Convolution2D_4", "class_name": "Conv2D", "config": {"name": "Convolution2D_4", "trainable": true, "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Activation_1", 0, 0, {}]]]}, {"name": "Convolution2D_5", "class_name": "Conv2D", "config": {"name": "Convolution2D_5", "trainable": true, "filters": 32, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Activation_1", 0, 0, {}]]]}, {"name": "Convolution2D_11", "class_name": "Conv2D", "config": {"name": "Convolution2D_11", "trainable": true, "filters": 16, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Input_2", 0, 0, {}]]]}, {"name": "Dropout_1", "class_name": "Dropout", "config": {"name": "Dropout_1", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Convolution2D_2", 0, 0, {}]]]}, {"name": "Dropout_2", "class_name": "Dropout", "config": {"name": "Dropout_2", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Convolution2D_3", 0, 0, {}]]]}, {"name": "Dropout_3", "class_name": "Dropout", "config": {"name": "Dropout_3", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Convolution2D_4", 0, 0, {}]]]}, {"name": "Dropout_4", "class_name": "Dropout", "config": {"name": "Dropout_4", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Convolution2D_5", 0, 0, {}]]]}, {"name": "MaxPooling2D_3", "class_name": "MaxPooling2D", "config": {"name": "MaxPooling2D_3", "trainable": true, "pool_size": [8, 8], "padding": "valid", "strides": [8, 8], "data_format": "channels_last"}, "inbound_nodes": [[["Convolution2D_11", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "axis": -1}, "inbound_nodes": [[["Dropout_1", 0, 0, {}], ["Dropout_2", 0, 0, {}], ["Activation_1", 0, 0, {}], ["Dropout_3", 0, 0, {}], ["Dropout_4", 0, 0, {}]]]}, {"name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "axis": -1}, "inbound_nodes": [[["MaxPooling2D_3", 0, 0, {}], ["concatenate_2", 0, 0, {}]]]}, {"name": "BatchNormalization_3", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "Activation_3", "class_name": "Activation", "config": {"name": "Activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNormalization_3", 0, 0, {}]]]}, {"name": "Convolution2D_12", "class_name": "Conv2D", "config": {"name": "Convolution2D_12", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Activation_3", 0, 0, {}]]]}, {"name": "BatchNormalization_4", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_4", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution2D_12", 0, 0, {}]]]}, {"name": "Activation_4", "class_name": "Activation", "config": {"name": "Activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNormalization_4", 0, 0, {}]]]}, {"name": "Convolution2D_13", "class_name": "Conv2D", "config": {"name": "Convolution2D_13", "trainable": true, "filters": 16, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Activation_4", 0, 0, {}]]]}, {"name": "Dropout_9", "class_name": "Dropout", "config": {"name": "Dropout_9", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Convolution2D_13", 0, 0, {}]]]}, {"name": "concatenate_4", "class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "axis": -1}, "inbound_nodes": [[["Dropout_9", 0, 0, {}], ["concatenate_3", 0, 0, {}]]]}, {"name": "BatchNormalization_5", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_5", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"name": "Activation_5", "class_name": "Activation", "config": {"name": "Activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNormalization_5", 0, 0, {}]]]}, {"name": "Convolution2D_14", "class_name": "Conv2D", "config": {"name": "Convolution2D_14", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Activation_5", 0, 0, {}]]]}, {"name": "BatchNormalization_6", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_6", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution2D_14", 0, 0, {}]]]}, {"name": "Activation_6", "class_name": "Activation", "config": {"name": "Activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNormalization_6", 0, 0, {}]]]}, {"name": "Convolution2D_15", "class_name": "Conv2D", "config": {"name": "Convolution2D_15", "trainable": true, "filters": 16, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Activation_6", 0, 0, {}]]]}, {"name": "Dropout_10", "class_name": "Dropout", "config": {"name": "Dropout_10", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Convolution2D_15", 0, 0, {}]]]}, {"name": "concatenate_5", "class_name": "Concatenate", "config": {"name": "concatenate_5", "trainable": true, "axis": -1}, "inbound_nodes": [[["Dropout_10", 0, 0, {}], ["concatenate_4", 0, 0, {}]]]}, {"name": "BatchNormalization_7", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_7", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}, {"name": "Activation_7", "class_name": "Activation", "config": {"name": "Activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNormalization_7", 0, 0, {}]]]}, {"name": "Convolution2D_16", "class_name": "Conv2D", "config": {"name": "Convolution2D_16", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Activation_7", 0, 0, {}]]]}, {"name": "BatchNormalization_8", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_8", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution2D_16", 0, 0, {}]]]}, {"name": "Activation_8", "class_name": "Activation", "config": {"name": "Activation_8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNormalization_8", 0, 0, {}]]]}, {"name": "Convolution2D_17", "class_name": "Conv2D", "config": {"name": "Convolution2D_17", "trainable": true, "filters": 16, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Activation_8", 0, 0, {}]]]}, {"name": "Dropout_11", "class_name": "Dropout", "config": {"name": "Dropout_11", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Convolution2D_17", 0, 0, {}]]]}, {"name": "concatenate_6", "class_name": "Concatenate", "config": {"name": "concatenate_6", "trainable": true, "axis": -1}, "inbound_nodes": [[["Dropout_11", 0, 0, {}], ["concatenate_5", 0, 0, {}]]]}, {"name": "BatchNormalization_9", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_9", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_6", 0, 0, {}]]]}, {"name": "Activation_9", "class_name": "Activation", "config": {"name": "Activation_9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNormalization_9", 0, 0, {}]]]}, {"name": "Convolution2D_18", "class_name": "Conv2D", "config": {"name": "Convolution2D_18", "trainable": true, "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Activation_9", 0, 0, {}]]]}, {"name": "BatchNormalization_10", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_10", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Convolution2D_18", 0, 0, {}]]]}, {"name": "Activation_10", "class_name": "Activation", "config": {"name": "Activation_10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNormalization_10", 0, 0, {}]]]}, {"name": "Convolution2D_19", "class_name": "Conv2D", "config": {"name": "Convolution2D_19", "trainable": true, "filters": 16, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Activation_10", 0, 0, {}]]]}, {"name": "Dropout_12", "class_name": "Dropout", "config": {"name": "Dropout_12", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Convolution2D_19", 0, 0, {}]]]}, {"name": "concatenate_7", "class_name": "Concatenate", "config": {"name": "concatenate_7", "trainable": true, "axis": -1}, "inbound_nodes": [[["Dropout_12", 0, 0, {}], ["concatenate_6", 0, 0, {}]]]}, {"name": "BatchNormalization_11", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_11", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_7", 0, 0, {}]]]}, {"name": "Activation_11", "class_name": "Activation", "config": {"name": "Activation_11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNormalization_11", 0, 0, {}]]]}, {"name": "Convolution2D_20", "class_name": "Conv2D", "config": {"name": "Convolution2D_20", "trainable": true, "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Activation_11", 0, 0, {}]]]}, {"name": "UpSampling2D_1", "class_name": "UpSampling2D", "config": {"name": "UpSampling2D_1", "trainable": true, "size": [8, 8], "data_format": "channels_last"}, "inbound_nodes": [[["Convolution2D_20", 0, 0, {}]]]}, {"name": "ZeroPadding2D_1", "class_name": "ZeroPadding2D", "config": {"name": "ZeroPadding2D_1", "trainable": true, "padding": [[2, 2], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["UpSampling2D_1", 0, 0, {}]]]}, {"name": "Convolution2D_21", "class_name": "Conv2D", "config": {"name": "Convolution2D_21", "trainable": true, "filters": 1, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Input_2", 0, 0, {}]]]}, {"name": "concatenate_8", "class_name": "Concatenate", "config": {"name": "concatenate_8", "trainable": true, "axis": 3}, "inbound_nodes": [[["ZeroPadding2D_1", 0, 0, {}], ["Convolution2D_21", 0, 0, {}]]]}, {"name": "BatchNormalization_12", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_12", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"name": "Activation_12", "class_name": "Activation", "config": {"name": "Activation_12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNormalization_12", 0, 0, {}]]]}, {"name": "Convolution2D_22", "class_name": "Conv2D", "config": {"name": "Convolution2D_22", "trainable": true, "filters": 16, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Activation_12", 0, 0, {}]]]}, {"name": "concatenate_9", "class_name": "Concatenate", "config": {"name": "concatenate_9", "trainable": true, "axis": 3}, "inbound_nodes": [[["Convolution2D_22", 0, 0, {}], ["concatenate_8", 0, 0, {}]]]}, {"name": "BatchNormalization_13", "class_name": "BatchNormalization", "config": {"name": "BatchNormalization_13", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"name": "Activation_13", "class_name": "Activation", "config": {"name": "Activation_13", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["BatchNormalization_13", 0, 0, {}]]]}, {"name": "Convolution2D_23", "class_name": "Conv2DTranspose", "config": {"name": "Convolution2D_23", "trainable": true, "filters": 1, "kernel_size": [9, 9], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Activation_13", 0, 0, {}]]]}, {"name": "Activation_14", "class_name": "Activation", "config": {"name": "Activation_14", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["Convolution2D_23", 0, 0, {}]]]}], "input_layers": [["Input_1", 0, 0], ["Input_2", 0, 0]], "output_layers": [["Activation_14", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow"}